---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.ValidatePHSegmentLengthWarning
source: html/56aff7ee-4f46-8063-afbf-17649c7c667d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.ValidatePHSegmentLengthWarning Property

The placeholder curve is not long enough to support the required fittings for placeholder convert

## Syntax (C#)
```csharp
public static FailureDefinitionId ValidatePHSegmentLengthWarning { get; }
```